//
//  UkrainianFormatter+Initialization.m
//  IDAP_2018
//
//  Created by Yevhen Triukhan on 15.08.18.
//  Copyright © 2018 Yevhen Triukhan. All rights reserved.
//

#import "UkrainianFormatter.h"
#import "NumeralsFormatter_PrivateHeader.h"


@implementation UkrainianFormatter (Initialization)
+ (instancetype)formatter {
    UkrainianFormatter *formatter = [UkrainianFormatter new];
    
    formatter.localeID         = kUA;
    
    formatter.cardinalUnits    = @[
                                   @"нуль",
                                   @"один",
                                   @"два",
                                   @"три",
                                   @"чотири",
                                   @"п'ять",
                                   @"шість",
                                   @"сім",
                                   @"вісім",
                                   @"дев'ять",
                                   
                                   @"десять",
                                   @"одинадцять",
                                   @"дванадцять",
                                   @"тринадцять",
                                   @"чотирнадцять",
                                   @"п'ятнадцять",
                                   @"шістнадцять",
                                   @"сімнадцять",
                                   @"вісімнадцять",
                                   @"дев'ятнадцять",

                                   ];
    
    formatter.cardinalTens     = @[
                                   kEMPTY_STRING,
                                   @"десять",
                                   @"двадцять",
                                   @"тридцять",
                                   @"сорок",
                                   @"п'ятдесят",
                                   @"шістдесят",
                                   @"сімдесят",
                                   @"вісімдесят",
                                   @"дев'яносто",
                                   ];
    
    
    formatter.cardinalHundreds = @[
                                   kEMPTY_STRING,
                                   @"сто",
                                   @"двісті",
                                   @"триста",
                                   @"чотириста",
                                   @"п'ятсот",
                                   @"шістсот",
                                   @"сімсот",
                                   @"вісімсот",
                                   @"дев'ятсот",
                                   ];
    
    formatter.cardinalLarge    = @[
                                   kEMPTY_STRING,
                                   @"тисяча",
                                   @"мільйон",
                                   @"мільярд",
                                   @"більйон"
                                   ];
    
    formatter.exceptions       = @{
                                   @"unitsForThousend" : @{  //  female
                                           @"один" : @"одна",
                                           @"два" : @"дві",
                                           },
                                   
                                   @"ordinalForm" : @{
                                           @"нуль" : @"нульовий",
                                           @"один" : @"перший",
                                           @"два" : @"другий",
                                           @"три" : @"третій",
                                           @"чотири" : @"четвертий",
                                           @"п'ять" : @"п'ятий",
                                           @"шість" : @"шостий",
                                           @"сім" : @"сьомий",
                                           @"вісім" : @"восьмий",
                                           @"дев'ять" : @"дев'ятий",
                                           
                                           @"десять" : @"десятий",
                                           @"одинадцять" : @"одинадцятий",
                                           @"дванадцять" : @"дванадцятий",
                                           @"тринадцять" : @"тринадцятий",
                                           @"чотирнадцять" : @"чотирнадцятий",
                                           @"п'ятнадцять" : @"п'ятнадцятий",
                                           @"шістнадцять" : @"шістнадцятий",
                                           @"сімнадцять" : @"сімнадцятий",
                                           @"вісімнадцять" : @"вісімнадцятий",
                                           @"дев'ятнадцять" : @"дев'ятнадцятий",
                                           
                                           @"двадцять" : @"двадцятий",
                                           @"тридцять" : @"тридцятий",
                                           @"сорок" : @"сороковий",
                                           @"п'ятдесят" : @"п'ятдесятий",
                                           @"шістдесят" : @"шістдесятий",
                                           @"сімдесят" : @"сімдесятий",
                                           @"вісімдесят" : @"вісімдесятий",
                                           @"дев'яносто" : @"дев'яностий",
                                           
                                           @"сто" : @"сотий",
                                           @"двісті" : @"двохсотий",
                                           @"триста" : @"трьохсотий",
                                           @"чотириста" : @"чотирьохсотий",
                                           @"п'ятсот" : @"п'ятисотий",
                                           @"шістсот" : @"шістсотий",
                                           @"сімсот" : @"семісотий",
                                           @"вісімсот" : @"восьмисотий",
                                           @"дев'ятсот" : @"дев'ятисотий",
                                           
                                           @"тисяча"    : @"тисячний",
                                           @"мільйон"  : @"мільйонний",
                                           @"більйон"  : @"більйонний",
                                           @"трильйон" : @"трильйонний",
                                           @"мільярд"  : @"мільярдний"
                                           },

                                   @"genitiveForm" : @{  //  род падеж
                                           @"один" : @"одно",
                                           @"два" : @"двох",
                                           @"три" : @"трьох",
                                           @"чотири" : @"чотирьох",
                                           @"п'ять" : @"п'яти",
                                           @"шість" : @"шести",
                                           @"сім" : @"семи",
                                           @"вісім" : @"восьми",
                                           @"дев'ять" : @"дев'яти",
                                           
                                           @"десять" : @"десяти",
                                           @"одинадцять" : @"одинадцяти",
                                           @"дванадцять" : @"дванадцяти",
                                           @"тринадцять" : @"тринадцяти",
                                           @"чотирнадцять" : @"чотирнадцяти",
                                           @"п'ятнадцять" : @"п'ятнадцяти",
                                           @"шістнадцять" : @"шістнадцяти",
                                           @"сімнадцять" : @"сімнадцяти",
                                           @"вісімнадцять" : @"вісімнадцяти",
                                           @"дев'ятнадцять" : @"дев'ятнадцяти",
                                           
                                           @"двадцять" : @"двадцяти",
                                           @"тридцять" : @"тридцяти",
                                           @"сорок" : @"сорока",
                                           @"п'ятдесят" : @"п'ятдесяти",
                                           @"шістдесят" : @"шістдесяти",
                                           @"сімдесят" : @"сімдесяти",
                                           @"вісімдесят" : @"вісімдесяти",
                                           @"дев'яносто" : @"дев'яноста",
                                           
                                           @"сто" : @"сто",
                                           @"двісті" : @"двохсот",
                                           @"триста" : @"трьохсот",
                                           @"чотириста" : @"чотириста",
                                           @"п'ятсот" : @"п'ятисот",
                                           @"шістсот" : @"шестисот",
                                           @"сімсот" : @"семисот",
                                           @"вісімсот" : @"вісімсот",
                                           @"дев'ятсот" : @"дев'ятсот"
                                           },
                                   @"ordinalPrefixes" : @{
                                           @"тисяч" : @"тисячний",
                                           @"мільйон" : @"мільйонний",
                                           @"більйон" : @"більйонний",
                                           @"трильйон" : @"трильйонний",
                                           @"мільярд" : @"мільярдний"
                                           },                                   };
    
    return formatter;
}

@end
