public class Russian extends Language {
    public Russian() {
        numbToWord = new String[][]{
                {},
                {"ноль", "один", "два", "три", "четыре", "пять", "шесть", "семь", "восемь", "девять"},
                {"", "", "двадцать", "тридцать", "сорок", "пятьдесят", "шестьдесят", "семьдесят", "восемьдесят", "девяносто", "десять", "одиннадцать", "двенадцать", "тринадцать", "четырнадцать", "пятнадцать", "шестнадцать", "семнадцать", "восемнадцать", "девятнадцать"},
                {"", "сто", "двести", "триста", "четыреста", "пятьсот", "шестьсот", "семьсот", "восемьсот", "девятьсот"},
                {"тысяч", "тысяча", "тысячи", "тысячи", "тысячи", "тысяч"},
                {"миллионов", "миллион", "миллиона", "миллиона", "миллиона", "миллионов"},
                {"миллиардов", "миллиард", "миллиарда", "миллиарда", "миллиарда", "миллиардов"},
                {"триллионов", "триллион", "триллиона", "триллиона", "триллиона", "триллионов"},
                {"квадриллионов", "квадриллион", "квадриллиона", "квадриллиона", "квадриллиона", "квадриллионов"}
        };

        variations = new String[][]{
                {},
                {},
                {},
                {},
                {"", "одна", "две"},
                {},
                {},
                {},
                {}
        };

        separator = new String[] {" ", " ", " ", " ", " ", " ", " ", " ", " "};

        reverseSequence = false;
    }
}