public class Ukrainian extends Language {
    public Ukrainian() {
        numbToWord = new String[][]{
                {},
                {"нуль", "один", "два", "три", "чотири", "п'ять", "шість", "сім", "вісім", "дев'ять"},
                {"", "", "двадцять", "тридцять", "сорок", "п'ятдесят", "шістдесят", "сімдесят", "вісімдесят", "дев'яносто", "десять", "одинадцять", "дванадцять", "тринадцять", "чотирнадцять", "п'ятнадцять", "шістнадцять", "сімнадцять", "вісімнадцять", "дев'ятнадцять"},
                {"", "сто", "двісті", "триста", "чотириста", "п'ятсот", "шістсот", "сімсот", "вісімсот", "дев'ятсот"},
                {"тисяч", "тисяча", "тисячі", "тисячі", "тисячі", "тисяч"},
                {"мільйонів", "мільйон", "мільйона", "мільйона", "мільйона", "мільйонів"},
                {"мільярдів", "мільярд", "мільярди", "мільярди", "мільярди", "мільярдів"},
                {"трильйонів", "трильйон", "трильйони", "трильйони", "трильйони", "трильйонів"},
                {"квадрильйонів", "квадрильйон", "квадрильйони", "квадрильйони", "квадрильйони", "квадрильйонів"}
        };

        variations = new String[][]{
                {},
                {},
                {},
                {},
                {"", "одна", "дві"},
                {},
                {},
                {},
                {}
        };

        separator = new String[] {" ", " ", " ", " ", " ", " ", " ", " ", " "};

        reverseSequence = false;
    }
}
